import { observer } from 'mobx-react-lite'
import React from 'react'
import { Link } from 'react-router-dom'
import styled from 'styled-components'
import { ROOMS_ROUTE } from '../../utils/const'


const  FirstStage = observer(() => {
  return ( 
    <Info>
        <Div>
        <h3><span style={{color:'#f6a617'}}>•</span> Суть нашего обучения?<span style={{color:'#f6a617'}}>•</span></h3>

Суть нашего обучения заключается в том, чтобы показать и рассказать, как работает накопительный счет в банках, наглядным и практичным способом. Мы хотим, чтобы вы не просто получили теоретические знания, но и сами увидели, как накопительный счет может помочь вам управлять своими сбережениями
<br/><br/>
<h3><span style={{color:'#f6a617'}}>•</span>Знания, которые вы получите:<span style={{color:'#f6a617'}}>•</span></h3>

 Застрахованы ли накопительные счета в банках?<br/>
 Как рассчитываются налоги с накопительного счета?<br/>
 Минимальные требования к остатку<br/>
 Комиссии за обслуживание<br/>
 Процентные ставки<br/>
 Способы внесения и снятия средств<br/>
 Доступ к средствам<br/>
 <br/><br/>
<h3><span style={{color:'#f6a617'}}>•</span>В чем заключается суть наглядного обучения?<span style={{color:'#f6a617'}}>•</span></h3>

Наглядное обучение заключается в предоставлении учащимся практического, интерактивного опыта, который помогает им лучше понять концепции и навыки. В нашем случае мы будем использовать примеры из реальной жизни и демонстрации, чтобы показать вам, как работает накопительный счет.
<br/><br/>
<b><span style={{color:'#f6a617'}}>•</span>Как проходит обучение?</b>

Обучение проходит в формате поэтапного группового обучения. Это означает, что мы собираем группу людей и проводим обучение поэтапно. Вы не перейдете на следующий этап, пока не будет заполнена вся группа. Такой подход позволяет нам уделить каждому участнику должное внимание и ответить на все имеющиеся вопросы.
<br/><br/>
<b><span style={{color:'#f6a617'}}>•</span>Кому подходит это обучение?</b>

Это обучение подходит для всех, кто хочет узнать больше о накопительных счетах в банках, включая:
<br/>
 Людей, которые хотят начать сберегать деньги
 Людей, которые хотят узнать больше о различных вариантах сбережений
 Людей, которые хотят узнать, как накопительный счет может помочь им достичь своих финансовых целей
 <br/><br/>
<b><span style={{color:'#f6a617'}}>•</span>Чего ожидать от обучения?</b>
По завершении обучения вы сможете:
<br/>
 Понимать, как работает накопительный счет в банках
 Знать, как выбрать правильный накопительный счет для ваших нужд
 Уметь эффективно управлять своими сбережениями
 Чувствовать себя уверенно в использовании накопительного счета для достижения своих финансовых целей
 <br/>
Если вы ищете наглядный и практичный способ узнать больше о накопительных счетах в банках, то наше обучение - это то, что вам нужно.
<br/> <br/>
<h3><span style={{color:'#f6a617'}}>•</span>Как работает накопительный счет<span style={{color:'#f6a617'}}>•</span></h3>
Разные банки предлагают разные условия, такие как Процентная ставка, Длительность, Сумма,  показывают разнообразие доступных отечественным потребителям накопительных счетов. Другим важным выводом, который можно сделать из внимательного изучения банковских продуктов, становится отсутствие единого подхода к работе НС у различных финансовых организаций.

Одни банки предлагают открыть счет без лимитов по сроку или сумме. Другие – напротив – стремятся несколько ограничить клиентов, но предлагают более высокую процентную ставку. Результатом становится возможность выбрать оптимальный вариант вложений имеющихся финансовых ресурсов с учетом персональных потребностей конкретного вкладчика.
<br/>
<br/>
<h3><span style={{color:'#f6a617'}}>•</span>Подвох и преимущества накопительного счета.<span style={{color:'#f6a617'}}>•</span></h3>

В чем подвох и опасность счетов
Накопительные счета имеют не только преимущества, но и ряд недостатков. Поэтому для эффективного использования первых и минимизации негатива от вторых требуется внимательно изучение существующих подводных камней, к числу которых относятся:
<br/><br/>
<ol style={{marginLeft: '15px'}}>
  <li>Низкий процент. Обычно ставка по НС несколько ниже депозитов, что компенсируется возможностями снимать деньги или пополнять счет при необходимости.</li>
  <li>Плавающая ставка. Некоторые банки устанавливают так называемый плавающий процент. Он зависит от суммы остатков на счете, что необходимо учитывать при выборе лучшего из доступных вариантов вложений.</li>
  <li>Ориентация на российский рубль. Сегодня сложно найти на рынке предложения открыть НС в иностранной валюте, что снижает возможности по диверсификации вложений.</li>
</ol>
<br/>
<b><span style={{color:'#f6a617'}}>•</span>Преимущества накопительных счетов</b>
Популярность НС как альтернативного варианта накопления и приумножения финансовых ресурсов объясняется несколькими важными плюсами банковского продукта. В их число входят:
<br/>
<ol style={{marginLeft: '15px'}}>
  <li>Отсутствие или минимум ограничений по размеру остатка на счете.</li>
  <li>Возможность как пополнить НС, так и снять с него деньги при необходимости.</li>
  <li>Эффективная процентная ставка, более выгодная, чем для сберегательных счетов или вкладов до востребования.</li>
  <li>Гибкость правил размещения денежных средств, позволяющая быстро реагировать на изменения банковского рынка.</li>
</ol>
<br/>
</Div>
<Link to={ROOMS_ROUTE}><SwimBut>НАЗАД</SwimBut></Link>
    </Info>
  )
})

const Info = styled.div`
    line-height: 22px;
    flex: 1 1 auto;
    display: flex;
    flex-direction: column;
`
const SwimBut = styled.div`
line-height: normal;
background-color: #f6a617;
padding: 5px;
border-radius: 50%;
justify-content: center;
align-items: center;
font-size: 13pt;
cursor: pointer;
display: flex;
z-index: 2;
`
const Div = styled.div`
display: flex;
    flex-direction: column;
    flex: 1 1 auto;
`
export default FirstStage; 
